/* automatically generated by rust-bindgen 0.71.1 */

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[allow(unused_imports)]
    use self::super::root;
    pub const POSIX: u32 = 1;
    pub const LINUX: u32 = 1;
    pub const _LINUX: u32 = 1;
    pub const COMPILER_GCC: u32 = 1;
    pub const _GLIBCXX_CSTDDEF: u32 = 1;
    pub const _GLIBCXX_CXX_CONFIG_H: u32 = 1;
    pub const _GLIBCXX_RELEASE: u32 = 15;
    pub const __GLIBCXX__: u32 = 20250425;
    pub const _GLIBCXX_HAVE_ATTRIBUTE_VISIBILITY: u32 = 1;
    pub const _GLIBCXX_USE_DEPRECATED: u32 = 1;
    pub const _GLIBCXX_EXTERN_TEMPLATE: u32 = 1;
    pub const _GLIBCXX_USE_DUAL_ABI: u32 = 1;
    pub const _GLIBCXX_USE_CXX11_ABI: u32 = 1;
    pub const _GLIBCXX_INLINE_VERSION: u32 = 0;
    pub const _GLIBCXX_HAVE_IS_CONSTANT_EVALUATED: u32 = 1;
    pub const _GLIBCXX_ASSERTIONS: u32 = 1;
    pub const _GLIBCXX_VERBOSE_ASSERT: u32 = 1;
    pub const _GLIBCXX_USE_ALLOCATOR_NEW: u32 = 1;
    pub const _GLIBCXX_OS_DEFINES: u32 = 1;
    pub const __NO_CTYPE: u32 = 1;
    pub const _FEATURES_H: u32 = 1;
    pub const _ISOC95_SOURCE: u32 = 1;
    pub const _ISOC99_SOURCE: u32 = 1;
    pub const _ISOC11_SOURCE: u32 = 1;
    pub const _ISOC23_SOURCE: u32 = 1;
    pub const _ISOC2Y_SOURCE: u32 = 1;
    pub const _POSIX_SOURCE: u32 = 1;
    pub const _POSIX_C_SOURCE: u32 = 200809;
    pub const _XOPEN_SOURCE: u32 = 700;
    pub const _XOPEN_SOURCE_EXTENDED: u32 = 1;

    pub const __glibcxx_memory_resource: u32 = 201603;
    pub const __glibcxx_node_extract: u32 = 201606;
    pub const __glibcxx_parallel_algorithm: u32 = 201603;
    pub const __glibcxx_scoped_lock: u32 = 201703;
    pub const __glibcxx_shared_mutex: u32 = 201505;
    pub const __glibcxx_shared_ptr_weak_type: u32 = 201606;
    pub const __glibcxx_string_view: u32 = 201803;
    pub const __glibcxx_unordered_map_try_emplace: u32 = 201411;
    pub const __glibcxx_optional: u32 = 201606;
    pub const __glibcxx_constexpr_char_traits: u32 = 201611;
    pub const __glibcxx_constexpr_string: u32 = 201611;
    pub const SOURCE_ENGINE_UNKNOWN: u32 = 0;
    pub const SOURCE_ENGINE_ORIGINAL: u32 = 1;
    pub const SOURCE_ENGINE_EPISODEONE: u32 = 2;
    pub const SOURCE_ENGINE_ORANGEBOX: u32 = 3;
    pub const SOURCE_ENGINE_LEFT4DEAD: u32 = 4;
    pub const SOURCE_ENGINE_DARKMESSIAH: u32 = 5;
    pub const SOURCE_ENGINE_ORANGEBOXVALVE_DEPRECATED: u32 = 6;
    pub const SOURCE_ENGINE_LEFT4DEAD2: u32 = 7;
    pub const SOURCE_ENGINE_ALIENSWARM: u32 = 8;
    pub const SOURCE_ENGINE_BLOODYGOODTIME: u32 = 9;
    pub const SOURCE_ENGINE_EYE: u32 = 10;
    pub const SOURCE_ENGINE_PORTAL2: u32 = 11;
    pub const SOURCE_ENGINE_CSGO: u32 = 12;
    pub const SOURCE_ENGINE_CSS: u32 = 13;
    pub const SOURCE_ENGINE_DOTA: u32 = 14;
    pub const SOURCE_ENGINE_HL2DM: u32 = 15;
    pub const SOURCE_ENGINE_DODS: u32 = 16;
    pub const SOURCE_ENGINE_TF2: u32 = 17;
    pub const SOURCE_ENGINE_NUCLEARDAWN: u32 = 18;
    pub const SOURCE_ENGINE_SDK2013: u32 = 19;
    pub const SOURCE_ENGINE_BLADE: u32 = 20;
    pub const SOURCE_ENGINE_INSURGENCY: u32 = 21;
    pub const SOURCE_ENGINE_CONTAGION: u32 = 22;
    pub const SOURCE_ENGINE_BMS: u32 = 23;
    pub const SOURCE_ENGINE_DOI: u32 = 24;
    pub const SOURCE_ENGINE_MOCK: u32 = 25;
    pub const SOURCE_ENGINE_PVKII: u32 = 26;
    pub const SOURCE_ENGINE_MCV: u32 = 27;
    pub const SOURCE_ENGINE_CS2: u32 = 28;
    pub const SOURCE_ENGINE_DEADLOCK: u32 = 29;
    pub const METAMOD_PLAPI_VERSION: u32 = 17;
    pub const METAMOD_PLAPI_NAME: &[u8; 11] = b"ISmmPlugin\0";
    pub const METAMOD_FAIL_API_V1: u32 = 7;
    pub const METAMOD_FAIL_API_V2: u32 = 14;
    pub mod std {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub type nullptr_t = *const ::core::ffi::c_void;
        unsafe extern "C" {
            #[link_name = "\u{1}_ZSt21__glibcxx_assert_failPKciS0_S0_"]
            pub fn __glibcxx_assert_fail(
                __file: *const ::core::ffi::c_char,
                __line: ::core::ffi::c_int,
                __function: *const ::core::ffi::c_char,
                __condition: *const ::core::ffi::c_char,
            ) -> !;
        }
        pub type byte = ::core::ffi::c_uchar;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __byte_operand {
            pub _address: u8,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_bool__close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_bool__close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_char_close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_char_close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_signed_char_close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_signed_char_close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_unsigned_char_close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_unsigned_char_close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_wchar_t_close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_wchar_t_close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_char16_t_close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_char16_t_close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_char32_t_close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_char32_t_close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_short_close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_short_close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_unsigned_short_close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_unsigned_short_close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_int_close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_int_close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_unsigned_int_close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_unsigned_int_close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_long_close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_long_close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_unsigned_long_close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_unsigned_long_close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_long_long_close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_long_long_close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of template specialization: __byte_operand_open0_unsigned_long_long_close0"]
                [::core::mem::size_of::<root::std::__byte_operand>() - 1usize];
            ["Align of template specialization: __byte_operand_open0_unsigned_long_long_close0"]
                [::core::mem::align_of::<root::std::__byte_operand>() - 1usize];
        };
        pub type __byte_op_t = root::std::__byte_operand;
    }
    pub mod __gnu_cxx {
        #[allow(unused_imports)]
        use self::super::super::root;
    }
    #[repr(C)]
    #[repr(align(16))]
    #[derive(Debug, Copy, Clone)]
    pub struct max_align_t {
        pub __clang_max_align_nonce1: ::core::ffi::c_longlong,
        pub __bindgen_padding_0: u64,
        pub __clang_max_align_nonce2: u128,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of max_align_t"][::core::mem::size_of::<max_align_t>() - 32usize];
        ["Alignment of max_align_t"][::core::mem::align_of::<max_align_t>() - 16usize];
        ["Offset of field: max_align_t::__clang_max_align_nonce1"]
            [::core::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
        ["Offset of field: max_align_t::__clang_max_align_nonce2"]
            [::core::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
    };
    pub mod SourceMM {
        #[allow(unused_imports)]
        use self::super::super::root;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ISmmPlugin {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct ISmmAPI {
            _unused: [u8; 0],
        }
        #[doc = " @brief Used to uniquely identify plugins."]
        pub type PluginId = ::core::ffi::c_int;
        #[repr(C)]
        pub struct ISmmFailPlugin__bindgen_vtable(::core::ffi::c_void);
        #[doc = " Use this to instantiate a plugin that will always fail.\n This class definition works against major API versions 1 and 2."]
        #[repr(C)]
        #[derive(Debug)]
        pub struct ISmmFailPlugin {
            pub vtable_: *const ISmmFailPlugin__bindgen_vtable,
        }
        #[allow(clippy::unnecessary_operation, clippy::identity_op)]
        const _: () = {
            ["Size of ISmmFailPlugin"][::core::mem::size_of::<ISmmFailPlugin>() - 8usize];
            ["Alignment of ISmmFailPlugin"][::core::mem::align_of::<ISmmFailPlugin>() - 8usize];
        };
    }
    pub type METAMOD_PLUGIN = root::SourceMM::ISmmPlugin;
    #[doc = " @brief Contains version information."]
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct MetamodVersionInfo {
        #[doc = "< ISmmAPI major version"]
        pub api_major: ::core::ffi::c_int,
        #[doc = "< ISmmAPI minor version"]
        pub api_minor: ::core::ffi::c_int,
        #[doc = "< SourceHook interface version"]
        pub sh_iface: ::core::ffi::c_int,
        #[doc = "< SourceHook implementation version"]
        pub sh_impl: ::core::ffi::c_int,
        #[doc = "< Plugin API minimum version"]
        pub pl_min: ::core::ffi::c_int,
        #[doc = "< Plugin API maximum version"]
        pub pl_max: ::core::ffi::c_int,
        #[doc = "< Source Engine version (SOURCE_* constants)"]
        pub source_engine: ::core::ffi::c_int,
        #[doc = "< Game directory name"]
        pub game_dir: *const ::core::ffi::c_char,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of MetamodVersionInfo"][::core::mem::size_of::<MetamodVersionInfo>() - 40usize];
        ["Alignment of MetamodVersionInfo"][::core::mem::align_of::<MetamodVersionInfo>() - 8usize];
        ["Offset of field: MetamodVersionInfo::api_major"]
            [::core::mem::offset_of!(MetamodVersionInfo, api_major) - 0usize];
        ["Offset of field: MetamodVersionInfo::api_minor"]
            [::core::mem::offset_of!(MetamodVersionInfo, api_minor) - 4usize];
        ["Offset of field: MetamodVersionInfo::sh_iface"]
            [::core::mem::offset_of!(MetamodVersionInfo, sh_iface) - 8usize];
        ["Offset of field: MetamodVersionInfo::sh_impl"]
            [::core::mem::offset_of!(MetamodVersionInfo, sh_impl) - 12usize];
        ["Offset of field: MetamodVersionInfo::pl_min"]
            [::core::mem::offset_of!(MetamodVersionInfo, pl_min) - 16usize];
        ["Offset of field: MetamodVersionInfo::pl_max"]
            [::core::mem::offset_of!(MetamodVersionInfo, pl_max) - 20usize];
        ["Offset of field: MetamodVersionInfo::source_engine"]
            [::core::mem::offset_of!(MetamodVersionInfo, source_engine) - 24usize];
        ["Offset of field: MetamodVersionInfo::game_dir"]
            [::core::mem::offset_of!(MetamodVersionInfo, game_dir) - 32usize];
    };
    #[doc = " @brief Contains information about loading a plugin."]
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct MetamodLoaderInfo {
        #[doc = "< File path to the plugin being loaded."]
        pub pl_file: *const ::core::ffi::c_char,
        #[doc = "< Folder path containing the plugin."]
        pub pl_path: *const ::core::ffi::c_char,
    }
    #[allow(clippy::unnecessary_operation, clippy::identity_op)]
    const _: () = {
        ["Size of MetamodLoaderInfo"][::core::mem::size_of::<MetamodLoaderInfo>() - 16usize];
        ["Alignment of MetamodLoaderInfo"][::core::mem::align_of::<MetamodLoaderInfo>() - 8usize];
        ["Offset of field: MetamodLoaderInfo::pl_file"]
            [::core::mem::offset_of!(MetamodLoaderInfo, pl_file) - 0usize];
        ["Offset of field: MetamodLoaderInfo::pl_path"]
            [::core::mem::offset_of!(MetamodLoaderInfo, pl_path) - 8usize];
    };
    #[doc = " @brief If a function of this type is exposed as \"CreateInterface_MMS\", then\n Metamod:Source will attempt to call this function before calling\n CreateInterface.  If this function returns a valid ISmmPlugin pointer, then\n CreateInterface will not be called.\n\n This is useful for implementing a mini-loader plugin for multiple versions.\n\n @param mvi\t\t\t\tMetamodVersionInfo structure.\n @param mli\t\t\t\tMetamodLoaderInfo structure.\n @return\t\t\t\t\tISmmAPI pointer, or NULL if none."]
    pub type METAMOD_FN_LOAD = ::core::option::Option<
        unsafe extern "C" fn(
            mvi: *const root::MetamodVersionInfo,
            mli: *const root::MetamodLoaderInfo,
        ) -> *mut root::METAMOD_PLUGIN,
    >;
